brew "bash"
brew "cairo"
brew "ffmpeg"
brew "gcc"
brew "gh"
brew "git"
brew "git-lfs"
brew "gnupg"
brew "imagemagick"
brew "llama.cpp"
brew "ollama"
brew "pinentry-mac"
brew "podman"
brew "stow"
cask "adobe-acrobat-pro"
cask "appcleaner"
cask "claude"
cask "cloudflare-warp"
cask "cursor"
cask "docker-desktop"
cask "font-roboto-mono-nerd-font"
cask "ghostty"
cask "google-drive"
cask "iina"
cask "keka"
cask "mactex-no-gui"
cask "skim"
