brew "bash"
brew "eza"
brew "fd"
brew "ffmpeg"
brew "fzf"
brew "gcc"
brew "gh"
brew "git"
brew "git-lfs"
brew "gnupg"
brew "imagemagick"
brew "llama.cpp"
brew "neovim"
brew "node"
brew "pinentry-mac"
brew "ripgrep"
brew "stow"
brew "tlrc"
brew "tmux"
brew "uv"
brew "whisper-cpp"
brew "zoxide"
cask "alacritty"
cask "appcleaner"
cask "docker"
cask "font-roboto-mono"
cask "font-roboto-mono-nerd-font"
cask "iina"
cask "keka"
cask "mactex-no-gui"
cask "skim"
