tap "adoptopenjdk/openjdk"
tap "homebrew/autoupdate"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"
brew "webp"
brew "autoconf"
brew "automake"
brew "bash"
brew "berkeley-db", link: true
brew "glib"
brew "python@3.9"
brew "cmake"
brew "coreutils"
brew "deno"
brew "doxygen"
brew "exa"
brew "fd"
brew "gnutls"
brew "harfbuzz"
brew "openjpeg"
brew "libass"
brew "ffmpeg"
brew "node"
brew "firebase-cli"
brew "fish"
brew "libtool"
brew "unixodbc"
brew "freetds"
brew "gcc"
brew "geckodriver"
brew "gh"
brew "ghc"
brew "ghostscript"
brew "git"
brew "gnupg"
brew "go"
brew "gradle"
brew "graphviz"
brew "python@3.10"
brew "grip"
brew "httpd"
brew "ipython"
brew "jenv"
brew "libiconv"
brew "lua"
brew "luarocks"
brew "openjdk"
brew "maven"
brew "tree-sitter"
brew "neovim"
brew "openldap"
brew "pinentry-mac"
brew "postgresql@14", restart_service: true
brew "python-tk@3.9"
brew "ripgrep"
brew "ruby"
brew "shellcheck"
brew "smimesign"
brew "swi-prolog"
brew "tldr"
brew "tmux"
brew "vim"
brew "wget"
cask "adoptopenjdk11"
cask "adoptopenjdk16"
cask "adoptopenjdk8"
cask "chromedriver"
cask "font-roboto-mono"
cask "font-roboto-mono-nerd-font"
cask "keycastr"
cask "mactex"
cask "miniforge"
cask "weka"
