tap "domt4/autoupdate"
tap "ethereum/ethereum"
tap "homebrew/bundle"
brew "webp"
brew "autoconf"
brew "automake"
brew "bash"
brew "python@3.12"
brew "glib"
brew "cairo"
brew "certifi"
brew "cmake"
brew "coreutils"
brew "deno"
brew "docker-completion"
brew "eza"
brew "fd"
brew "gnutls"
brew "harfbuzz"
brew "openjpeg"
brew "libass"
brew "tesseract"
brew "ffmpeg"
brew "node"
brew "firebase-cli"
brew "fzf"
brew "gcc"
brew "gh"
brew "ghc"
brew "ghostscript"
brew "git"
brew "git-filter-repo"
brew "git-lfs"
brew "gnupg"
brew "go"
brew "grip"
brew "imagemagick"
brew "jenv"
brew "llama.cpp"
brew "lua"
brew "luajit"
brew "luarocks"
brew "tree-sitter"
brew "neovim"
brew "node@20"
brew "nvm"
brew "openjdk"
brew "openjdk@11"
brew "openjdk@17"
brew "openldap"
brew "pinentry-mac"
brew "pipx"
brew "pyenv"
brew "pyenv-virtualenv"
brew "tcl-tk"
brew "r"
brew "ripgrep"
brew "ruby"
brew "solidity"
brew "stow"
brew "tldr"
brew "tmux"
brew "zoxide"
cask "alacritty"
cask "charles"
cask "font-roboto-mono"
cask "font-roboto-mono-nerd-font"
cask "keycastr"
cask "mactex"
cask "skim"
cask "vlc"
vscode "catppuccin.catppuccin-vsc"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "ms-python.black-formatter"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-hub"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode.remote-explorer"
vscode "nomicfoundation.hardhat-solidity"
vscode "streetsidesoftware.code-spell-checker"
vscode "vscodevim.vim"
