tap "homebrew/autoupdate"
tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/services"
brew "glib"
brew "cairo"
brew "harfbuzz"
brew "openjdk"
brew "allure"
brew "webp"
brew "autoconf"
brew "automake"
brew "bash"
brew "berkeley-db", link: true
brew "bfg"
brew "cmake"
brew "conda-zsh-completion"
brew "coreutils"
brew "deno"
brew "docker-completion"
brew "doxygen"
brew "fd"
brew "gnutls"
brew "openjpeg"
brew "libass"
brew "tesseract"
brew "ffmpeg"
brew "node"
brew "firebase-cli"
brew "fish"
brew "libtool"
brew "unixodbc"
brew "freetds"
brew "gcc"
brew "geckodriver"
brew "gh"
brew "ghc"
brew "ghostscript"
brew "git"
brew "git-lfs"
brew "gnupg"
brew "go"
brew "gradle"
brew "graphviz"
brew "grip"
brew "httpd"
brew "ipython"
brew "jenv"
brew "libiconv"
brew "lua"
brew "luarocks"
brew "maven"
brew "tree-sitter"
brew "neovim"
brew "nvm"
brew "openjdk@11"
brew "openjdk@17"
brew "openldap"
brew "pinentry-mac"
brew "postgresql@14", restart_service: true
brew "python@3.9"
brew "python-tk@3.9"
brew "python@3.10"
brew "ripgrep"
brew "ruby"
brew "shellcheck"
brew "smimesign"
brew "swi-prolog"
brew "tldr"
brew "tmux"
brew "vim"
brew "wget"
cask "alacritty"
cask "chromedriver"
cask "docker"
cask "font-roboto-mono"
cask "font-roboto-mono-nerd-font"
cask "iterm2"
cask "keycastr"
cask "mactex"
cask "skim"
vscode "Catppuccin.catppuccin-vsc"
vscode "GitHub.copilot"
vscode "GitHub.copilot-chat"
vscode "ms-python.black-formatter"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-hub"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode.remote-explorer"
vscode "streetsidesoftware.code-spell-checker"
vscode "vscodevim.vim"
